Revit 2027 API
FabricationConfiguration.SetConfiguration(FabricationConfigurationInfo) Method
 Set the fabrication configuration with global profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetConfiguration(
	FabricationConfigurationInfo fabricationConfigurationInfo
)
Public Sub SetConfiguration (
	fabricationConfigurationInfo As FabricationConfigurationInfo
)
public:
void SetConfiguration(
	FabricationConfigurationInfo^ fabricationConfigurationInfo
)
member SetConfiguration :
        fabricationConfigurationInfo : FabricationConfigurationInfo -> unit
Parameters
fabricationConfigurationInfo FabricationConfigurationInfo
 The desired fabrication configuration.
Exceptions
Exception | Condition
InvalidOperationException |  The fabrication configuration cannot be swapped because the exiting fabrication configuration has already been used in the document. -or- Cannot set the configuration.
See Also
Reference
FabricationConfiguration Class
SetConfiguration Overload
Autodesk.Revit.DB Namespace